<a href="https://colab.research.google.com/github/Hebertws/BD2-INFO3/blob/main/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
connection = sqlite3.connect("prisma.sqlite")

query = """
create Table Turma(
  Codigo varchar(10) not null  primary key,
  Curso varchar(20) not null,
  Periodo int not null
);
"""
execute_query(connection, query)

query = """
create Table Aluno(
  RA varchar(7) not null,
  CodigoTurma varchar(10) not null,
  Nome text not null,
  DataNasc date not null,

  primary key(RA, CodigoTurma),
  foreign key(CodigoTurma) references Turma(Codigo) on delete restrict
);
"""
execute_query(connection, query)

query = """
create Table ContatoDoAluno(
  RAAluno varchar(7) not null primary key,
  contato text not null,

  foreign key(RAAluno) references Aluno(RA) on delete cascade
);
"""
execute_query(connection, query)

query = """
create Table Professor(
  ID varchar(8) not null primary key
);
"""
execute_query(connection, query)

query = """
create Table ContatoDoProfessor(
  IDProfessor varchar(8) not null primary key,
  contato text not null,

  foreign key(IDProfessor) references Professor(ID) on delete cascade
);
"""
execute_query(connection, query)

query = """
create Table ProfessorLecionaEmTurma(
  IDProfessor varchar(8) not null,
  CodigoTurma varchar(10) not null,
  Disciplina text not null,

  primary key(IDProfessor, CodigoTurma),
  foreign key(IDProfessor) references Professor(ID) on delete restrict,
  foreign key(CodigoTurma) references Turma(Codigo) on delete restrict
);
"""
execute_query(connection, query)

query = """
create Table Questionario(
  NumeroRef integer not null primary key autoincrement
);
"""
execute_query(connection, query)

query = """
create Table AlunoRespondeQuestionario(
  RAAluno varchar(7) not null,
  NumeroRefQuestionario integer not null,
  DataResposta date not null,

  primary key(RAAluno, NumeroRefQuestionario),
  foreign key(RAAluno) references Aluno(RA) on delete cascade,
  foreign key(NumeroRefQuestionario) references Questionario(NumeroRef) on delete restrict
);
"""
execute_query(connection, query)

query = "INSERT INTO Turma(Codigo, Curso, Periodo) VALUES ('0123456789', 'Informatica','Primeiro Ano');"
execute_query(connection, query)

query = "INSERT INTO Aluno(RA, CodigoTurma, Nome, DataNasc) VALUES ('0123456', '0123456789', 'Maria LÃºcia da Silva Rodrigues', '2006-09-17');"
execute_query(connection, query)

query = "INSERT INTO ContatoDoAluno(RAAluno, contato) VALUES ('0123456','nomedoaluno@gmail.com');"
execute_query(connection, query)

query = "INSERT INTO Professor(ID) VALUES ('6543210');"
execute_query(connection, query)

query = "INSERT INTO ContatoDoProfessor(IDProfessor, contato) VALUES ('6543210','nomeprofessor@gmail.com');"
execute_query(connection, query)

query = "INSERT INTO  ProfessorLecionaEmTurma(IDProfessor, CodigoTurma, Disciplina) VALUES ('6543210','0123456789', 'Banco de Dados');"
execute_query(connection, query)

Query create Table Turma executada.
Query create Table Aluno executada.
Query create Table ContatoDoAluno executada.
Query create Table Professor executada.
Query create Table ContatoDoProfessor executada.
Query create Table ProfessorLecionaEmTurma executada.
Query create Table Questionario executada.
Query create Table AlunoRespondeQuestionario executada.
Query INSERT INTO Turma executada.
1 linha(s) afetadas
Query INSERT INTO Aluno executada.
1 linha(s) afetadas
Query INSERT INTO ContatoDoAluno executada.
1 linha(s) afetadas
Query INSERT INTO Professor executada.
1 linha(s) afetadas
Query INSERT INTO ContatoDoProfessor executada.
1 linha(s) afetadas
Query INSERT INTO  ProfessorLecionaEmTurma executada.
1 linha(s) afetadas